RU/Files/day_2_Ext/TurboGGI/bentRotorStatorMRF/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// Field Dictionary

FoamFile
{
    version         2.0;
    format          ascii;
    class           volScalarField;
    object          k;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions       [0 2 -2 0 0 0 0];

internalField   uniform 4.86;


boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type           inletOutlet;
        inletValue     $internalField;
        value          $internalField;
    }

    bladeRotor
    {
        type            zeroGradient;
    }

    shaftRotor
    {
        type            zeroGradient;
    }

    shroudRotor
    {
        type            zeroGradient;
    }

    bladeStator
    {
        type            zeroGradient;
    }

    shaftStator
    {
        type            zeroGradient;
    }

    shroudStator
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            cyclic;
    }
}


// ************************************************************************* //
