RU/Files/day_2_Ext/TurboGGI/bentRotorStatorMRF/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.2                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p BiCGStab
    {
        preconditioner
        {
            type         DILU;
        }

        minIter          0;
        maxIter          1000;
        tolerance        1e-8;
        relTol           0.001;
    };
    U BiCGStab
    {
        preconditioner
        {
            type         DILU;
        }

        minIter           0;
        maxIter           1000;
        tolerance        1e-8;
        relTol           0.01;
    };
    h BiCGStab
    {
        preconditioner
        {
            type         DILU;
        }

        minIter          0;
        maxIter          1000;
        tolerance        1e-8;
        relTol           0.01;
    };
    k BiCGStab
    {
        preconditioner
        {
            type         DILU;
        }

        minIter          0;
        maxIter          1000;
        tolerance        1e-8;
        relTol           0.0;
    };
    epsilon BiCGStab
    {
        preconditioner
        {
            type         DILU;
        }

        minIter          0;
        maxIter          1000;
        tolerance        1e-8;
        relTol           0.0;
    };
}

PIMPLE
{
    nOuterCorrectors         1;
    nCorrectors              2;
    nNonOrthogonalCorrectors 0;
}


relaxationFactors
{
    // Note: under-relaxation factors used in wave-transmissive schemes
    U               0.5;
    p               1;
    h               0.5;
    rho             0.5;

    k               0.2;
    epsilon         0.2;
}

fieldBounds
{
    // No bounding
//     p     0    1e7;
//     T     0    10000;
//     U     1e6;

    // With bounding
    p      50     1e6;
    T      20    3000;
    U      1000;
}


// ************************************************************************* //
